In [58]:
import pandas as pd
import numpy as np

# Create Data Frame -> pd.DataFrame
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])
print(df)

# View Head Rows -> Data_name.head(1) -> Print First 5 Rows
print(f"Head row is:\n{df.head(1)}")

# View Tail Rows -> Data_name.tail(1) -> Print Last 5 Rows
print(f"Tail row is:\n{df.tail(1)}")

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9
Head row is:
   0  1  2
0  1  2  3
Tail row is:
   0  1  2
2  7  8  9

In [61]:
# Load Data Set -> pd.read_DataFormat('./FolderName/FileName')

coffee_newdata = pd.read_csv('./warmup-data/coffee.csv')
print(coffee_newdata)
print("\n")

results = pd.read_parquet('./data/results.parquet')
print(f"The result data in Parquet format is:\n{results.head()}")

Olympics_data = pd.read_excel('data/olympics-data.xlsx')
print(f"The Olympics data in Parquet format is:\n{Olympics_data.head()}")

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35


The result data in Parquet format is:
     year    type discipline                     event                     as  \
0  1912.0  Summer     Tennis    Singles, Men (Olympic)  Jean-François Blanchy
1  1912.0  Summer     Tennis    Doubles, Men (Olympic)  Jean-François Blanchy
2  1920.0  Summer     Tennis    Singles, Men (Olympic)  Jean-François Blanchy
3  1920.0  Summer     Tennis  Doubles, Mixed (Olympic)  Jean-François Blanchy
4  1920.0  Summer     Tennis    Doubles, Men (Olympic)  Jean-François Blanchy

   athlete_id  noc             team  place   tied medal
0           1  FRA             None   17.0   True  None
1           1  FRA   Jean Montariol    NaN  False  None
2           1  FRA             None   32.0   True  None
3           1  FRA  Jeanne Vaussard    8.0   True  None
4           1  FRA  Jacques Brugnon    4.0  False  None
The Olympics data in Parquet format is:
   athlete_id                   name   born_date    born_city  \
0           1  Jean-François Blanchy  1886-12-12     Bordeaux
1           2         Arnaud Boetsch  1969-04-01       Meulan
2           3           Jean Borotra  1898-08-13     Biarritz
3           4        Jacques Brugnon  1895-05-11  Paris VIIIe
4           5           Albert Canet  1878-04-17   Wandsworth

            born_region born_country     NOC  height_cm  weight_kg   died_date
0               Gironde          FRA  France        NaN        NaN  1960-10-02
1              Yvelines          FRA  France      183.0       76.0         NaN
2  Pyrénées-Atlantiques          FRA  France      183.0       76.0  1994-07-17
3                 Paris          FRA  France      168.0       64.0  1978-03-20
4               England          GBR  France        NaN        NaN  1930-07-25

In [ ]:
# Load Data into the CSV file -> df_name.to_csv('newFileName.csv')

coffee_newdata.to_csv('coffee_newdata.csv')

In [13]:
#Information about the DataFrame  -> df_name.info()
coffee_newdata.info()

# Removing Missing/Null values  ->  df_name.isnull().sum()
coffee_newdata.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Day          14 non-null     object
 1   Coffee Type  14 non-null     object
 2   Units Sold   14 non-null     int64
dtypes: int64(1), object(2)
memory usage: 468.0+ bytes

Day            0
Coffee Type    0
Units Sold     0
dtype: int64

In [62]:
# Count all the number of values  ->  df_name.count()
print(coffee_newdata.count())
print("\n")

# Counting all Values Based on the Groups  ->  df_name.value_counts('column_name')
print(coffee_newdata.value_counts('Coffee Type'))
print("\n")

# Group the Values Based on the Mean  ->  df_name.groupby('column_name').mean()
coffee_newdata.groupby("Coffee Type").sum()
coffee_newdata.groupby("Day").sum()

Day            14
Coffee Type    14
Units Sold     14
dtype: int64


Coffee Type
Espresso    7
Latte       7
Name: count, dtype: int64

             Coffee Type  Units Sold
Day
Friday     EspressoLatte          80
Monday     EspressoLatte          40
Saturday   EspressoLatte          80
Sunday     EspressoLatte          80
Thursday   EspressoLatte          70
Tuesday    EspressoLatte          50
Wednesday  EspressoLatte          60

In [101]:
#Total Sum of all values
print(coffee_newdata.sum())
print("\n")

# Max of the columns value
print(coffee_newdata.max())

Day            MondayMondayTuesdayTuesdayWednesdayWednesdayTh...
Coffee Type    EspressoLatteEspressoLatteEspressoLatteEspress...
Units Sold                                                   460
dtype: object


Day            Wednesday
Coffee Type        Latte
Units Sold            45
dtype: object

In [71]:
Data = {
    "Name": ['Alice', 'Bob', 'Charlie', 'Alpha', 'Beta', 'Gamma', 'theta', 'Delta'],
    "Age": [25, 30, 32, np.nan, 45, 67, np.nan, 89], # Missing Integer values as np.nan(not a number)
    "Country":["USA", "Canada", "UK", "Greece", "Finland", "Germany", None, "India"], # Missing Str values as None
    "Weight": [78, 79, 90, 87, 96, np.nan, np.nan, 80]
    }

df= pd.DataFrame(Data)
print(df)
print("\n")

# Info -> df.info()
print(df.info())

# Missing values -> df.isnull().sum()
df.isnull()

      Name   Age  Country  Weight
0    Alice  25.0      USA    78.0
1      Bob  30.0   Canada    79.0
2  Charlie  32.0       UK    90.0
3    Alpha   NaN   Greece    87.0
4     Beta  45.0  Finland    96.0
5    Gamma  67.0  Germany     NaN
6    theta   NaN     None     NaN
7    Delta  89.0    India    80.0


<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     8 non-null      object
 1   Age      6 non-null      float64
 2   Country  7 non-null      object
 3   Weight   6 non-null      float64
dtypes: float64(2), object(2)
memory usage: 388.0+ bytes
None

    Name    Age  Country  Weight
0  False  False    False   False
1  False  False    False   False
2  False  False    False   False
3  False   True    False   False
4  False  False    False   False
5  False  False    False    True
6  False   True     True    True
7  False  False    False   False

In [52]:
# Describe -> df.describe()
print(df.describe())
print("\n")

# Column -> df.columns
print(df.columns)
print("\n")

# Index -> df.index
print(df.index)
print("\n")

# Any 1 or 2.. Column only -> df[["Column_name", "Column_name"]]
print(coffee_newdata[["Day", "Units Sold"]])

             Age
count   3.000000
mean   29.000000
std     3.605551
min    25.000000
25%    27.500000
50%    30.000000
75%    31.000000
max    32.000000


Index(['Name', 'Age', 'Country'], dtype='object')


RangeIndex(start=0, stop=3, step=1)


          Day  Units Sold
0      Monday          25
1      Monday          15
2     Tuesday          30
3     Tuesday          20
4   Wednesday          35
5   Wednesday          25
6    Thursday          40
7    Thursday          30
8      Friday          45
9      Friday          35
10   Saturday          45
11   Saturday          35
12     Sunday          45
13     Sunday          35

In [69]:
# Set/List of the Countries -> set/list(df[column_name])
print(f"This is set with multiple columns:\n{set(df["Country"])}")
print(f"This is list with single column:\n{list(df["Country"])}") 
print(f"This is tuple with single column:\n{tuple(df["Country"])}") 
print(f"This is dictionary with multiple columns:\n{dict(df["Country"])}") 

# Length of the Countries -> len(df[coulumn_name])
print(len(df["Country"]))

# Values at a Particular Index -> df.iloc[index_name]
print(df.iloc[0])

This is set with multiple columns:
{None, 'Finland', 'UK', 'USA', 'Greece', 'Canada', 'India', 'Germany'}
This is list with single column:
['USA', 'Canada', 'UK', 'Greece', 'Finland', 'Germany', None, 'India']
This is tuple with single column:
('USA', 'Canada', 'UK', 'Greece', 'Finland', 'Germany', None, 'India')
This is dictionary with multiple columns:
{0: 'USA', 1: 'Canada', 2: 'UK', 3: 'Greece', 4: 'Finland', 5: 'Germany', 6: None, 7: 'India'}
8
Name       Alice
Age         25.0
Country      USA
Name: 0, dtype: object

In [ ]:
# Drop/Remove any Column -> df.drop(columns=["Column_name"], inplace = True) "Use inplace = True, if permanently want to delete"
print(df.drop(columns = ['Weight']))
print("\n")
print(df)

      Name   Age  Country Alice Price    price
0    Alice    30      USA   NaN   900      NaN
1    Alice    30      USA   NaN   900      NaN
2  Charlie  1130       UK   NaN        11300.0
3    Alpha  1800   Greece   NaN         1800.0
4     Beta  1200  Finland   NaN         1200.0
5    Gamma  67.0  Germany   NaN            NaN
6    theta   NaN     None   NaN            NaN
7    Delta  2000    India   NaN         2000.0


      Name   Age  Country Weight Alice Price    price
0    Alice    30      USA     78   NaN   900      NaN
1    Alice    30      USA     78   NaN   900      NaN
2  Charlie  1130       UK   90.0   NaN        11300.0
3    Alpha  1800   Greece   87.0   NaN         1800.0
4     Beta  1200  Finland   96.0   NaN         1200.0
5    Gamma  67.0  Germany    NaN   NaN            NaN
6    theta   NaN     None    NaN   NaN            NaN
7    Delta  2000    India   80.0   NaN         2000.0

In [83]:
#Filtering -> df[df["Column_name"].str.startswith/endswith("Letter")]
print(df[df["Name"].str.startswith("A")]) 
print("\n")
print(df[df["Country"].isin(["USA", "Finland"])])
print("\n")
# ~(Tilt operator) -> reverses the condition
print(df[~df["Country"].isin(["USA", "Finland"])])
print("\n")

#Filtering -> df[(df["Column_name"] == "value") &/| (df["Column_name"] == "value")]
df[(df["Country"] == "India") | (df["Weight"] == 87)]

    Name   Age Country  Weight
0  Alice  25.0     USA    78.0
3  Alpha   NaN  Greece    87.0


    Name   Age  Country  Weight
0  Alice  25.0      USA    78.0
4   Beta  45.0  Finland    96.0


      Name   Age  Country  Weight
1      Bob  30.0   Canada    79.0
2  Charlie  32.0       UK    90.0
3    Alpha   NaN   Greece    87.0
5    Gamma  67.0  Germany     NaN
6    theta   NaN     None     NaN
7    Delta  89.0    India    80.0

    Name   Age Country  Weight
3  Alpha   NaN  Greece    87.0
7  Delta  89.0   India    80.0

In [99]:
# Updating -> df.loc[df["Column_name"] == "value", Particular_Value] = "New_Value"
df.loc[df["Country"] == "USA", "Age"] = 30
print(df.loc[df["Name"] == "Alice"])
print("\n")
print(df)

    Name Age Country Weight Alice
0  Alice  30     USA     78   NaN
1  Alice  30     USA     78   NaN


      Name   Age  Country Weight Alice
0    Alice    30      USA     78   NaN
1    Alice    30      USA     78   NaN
2  Charlie  32.0       UK   90.0   NaN
3    Alpha   NaN   Greece   87.0   NaN
4     Beta  45.0  Finland   96.0   NaN
5    Gamma  67.0  Germany    NaN   NaN
6    theta   NaN     None    NaN   NaN
7    Delta  89.0    India   80.0   NaN

In [ ]:
# Save the DF into new file
df.to_csv('Data.csv')

# Add a Column Permanently to the data Frame -> df["Column_Name"] = "Value"
df["Price"] = " "
# Add a Column to the data Frame -> df.loc[df["Column_Name"] == "Value", "new_Column"] = value
df.loc[df["Country"] == "USA", "Price"] = 900
df.loc[df["Country"] == "UK", "price"] = 11300
df.loc[df["Country"] == "Finland", "price"] = 1200
df.loc[df["Country"] == "Greece", "price"] = 1800
df.loc[df["Country"] == "India", "price"] = 2000
df.loc[df["Country"] == "UK", "Age"] = 1130

print(df)

# In pandas, a DataFrame has labeled axes: the index (axis=0) and the columns (axis=1).When you use axis=0 in a pandas operation like df.sum(axis=0), you are telling pandas to perform the operation along the index. Just like in NumPy, this means the calculation moves down the rows for each column. The default for most pandas methods is axis=0, so you often don't even need to specify it.


print(df.drop(index=6, axis = 1))
# All the edits made here will also edit the newly made file Data.csv

      Name   Age  Country Weight Alice Price    price
0    Alice    30      USA     78   NaN   900      NaN
1    Alice    30      USA     78   NaN   900      NaN
2  Charlie  1130       UK   90.0   NaN        11300.0
3    Alpha  1800   Greece   87.0   NaN         1800.0
4     Beta  1200  Finland   96.0   NaN         1200.0
5    Gamma  67.0  Germany    NaN   NaN            NaN
6    theta   NaN     None    NaN   NaN            NaN
7    Delta  2000    India   80.0   NaN         2000.0
      Name   Age  Country Weight Alice Price    price
0    Alice    30      USA     78   NaN   900      NaN
1    Alice    30      USA     78   NaN   900      NaN
2  Charlie  1130       UK   90.0   NaN        11300.0
3    Alpha  1800   Greece   87.0   NaN         1800.0
4     Beta  1200  Finland   96.0   NaN         1200.0
5    Gamma  67.0  Germany    NaN   NaN            NaN
7    Delta  2000    India   80.0   NaN         2000.0

In [118]:
# Correlation -> df.corr()